<!-- <template>
  <div id="aplayer" style="border-radius: 10px; "></div>
</template>


<script>
import 'aplayer/dist/APlayer.min.css';
import APlayer from 'aplayer';

export default {
  name: 'HomeView',
  components: {},
  mounted() {
    this.addMyAudio();
  },
  data() {
    return {
      audio: [
        {
          name: "嘉宾",//歌名
          artist: '冬瓜强',//歌手
          url: 'https://www.dgq63136.icu/%E5%98%89%E5%AE%BE-%E5%86%AC%E7%93%9C%E5%BC%BA.mp3',//音频文件地址
          cover: 'https://ts1.cn.mm.bing.net/th?id=ODL.643f4e0bda0787dbbc622c4dd765bb04&w=298&h=298&c=10&rs=1&qlt=99&bgcl=fffffe&r=0&o=6&pid=WrapstarImage',//音乐封面地址
          lrc: '[00:00.25]分手后第几个冬季[00:19.65]今天是星期几[00:22.84]偶尔会想起你[00:28.43]你突如其来的简讯[00:32.54]让我措手不及[00:35.75]愣住站在原地(胖：Wow)[00:41.07]当所有人都替你开心[00:44.25]我却才傻傻清醒[00:46.97]原来早已有人为你订做了嫁衣[00:52.36]感谢你特别邀请[00:55.51]来见证你的爱情[00:58.74]我时刻提醒自己 别逃避[01:04.86]拿着喜帖一步一步走近[01:08.32]他精心布置的场地[01:11.87]可惜这是属于你的风景[01:15.38]而我只是嘉宾[01:18.03]我放下所有回忆[01:21.04]来成全你的爱情[01:24.14]却始终不愿相信 这是命[01:30.16]好久不见的你有点疏离[01:33.79]握手寒暄如此客气[01:37.48]何必要在他的面前刻意[01:40.96]隐瞒我的世界 有过你[02:08.74]不知不觉钟声响起[02:13.47]你守候在原地[02:16.48]等待着他靠近[02:21.89]温柔的他单膝跪地[02:26.11]钻戒缓缓戴进[02:29.23]你的无名指里[02:34.86]当所有人都替你开心[02:38.06]我却才傻傻清醒[02:40.21]原来我们之间已没有任何关系[02:45.78]感谢你特别邀请[02:08.98]来见证你的爱情[02:52.17]我时刻提醒自己 别逃避[02:58.21]今天你妆扮得格外美丽[03:01.73]这美也曾拥在怀里[03:05.49]可惜这是你和他的婚礼[03:09.01]而我只是嘉宾[03:11.38]我放下所有回忆[03:14.58]来成全你的爱情[03:07.79]却始终不愿相信 这是命[03:23.78]说好的永远变成了曾经[03:27.35]我试着衷心祝福你[03:31.00]请原谅我不体面没出息[03:34.60]选择失陪一下 先离席[03:41.81]又不是偶像剧[03:44.98]怎么我演得那么入戏[03:49.87]这不堪入目的剧情[03:56.40]感谢你特别邀请[03:59.38]观赏你要的爱情[04:02.56]嘉宾也许是另一种宿命[04:08.68]离开你的自己事到如今[04:12.54]还有什么资格关心[04:16.14]毕竟终成眷属的人是你[04:19.66]而我只是嘉宾[04:22.17]我流尽所有回忆[04:24.99]来庆祝你的婚礼[04:28.13]却始终没有勇气 祝福你[04:34.18]谢谢你送给我最后清醒[04:37.72]把自己还给我自己[04:44.67]至少我还能够成为那个[04:48.43]见证你们爱情的嘉宾[04:55.03]遇见你的他真的好幸运[04:58.88]但愿他会比我更爱你'
        },
        {
          name: "生日快乐歌",//歌名
          artist: '小团体',//歌手
          url: 'https://www.dgq63136.icu/%E5%B0%8F%E5%9B%A2%E4%BD%93-%E7%94%9F%E6%97%A5%E5%BF%AB%E4%B9%90%E6%AD%8C.mp3',//音频文件地址
          cover: 'https://tse4-mm.cn.bing.net/th/id/OIP-C.Xk5nmZbuv1UNIuWfGjcWMAHaC9?w=322&h=140&c=7&r=0&o=5&pid=1.7',//音乐封面地址
          lrc: '[00:00.25]分手后第几个冬季[00:19.65]今天是星期几[00:22.84]偶尔会想起你[00:28.43]你突如其来的简讯[00:32.54]让我措手不及[00:35.75]愣住站在原地(胖：Wow)[00:41.07]当所有人都替你开心[00:44.25]我却才傻傻清醒[00:46.97]原来早已有人为你订做了嫁衣[00:52.36]感谢你特别邀请[00:55.51]来见证你的爱情[00:58.74]我时刻提醒自己 别逃避[01:04.86]拿着喜帖一步一步走近[01:08.32]他精心布置的场地[01:11.87]可惜这是属于你的风景[01:15.38]而我只是嘉宾[01:18.03]我放下所有回忆[01:21.04]来成全你的爱情[01:24.14]却始终不愿相信 这是命[01:30.16]好久不见的你有点疏离[01:33.79]握手寒暄如此客气[01:37.48]何必要在他的面前刻意[01:40.96]隐瞒我的世界 有过你[02:08.74]不知不觉钟声响起[02:13.47]你守候在原地[02:16.48]等待着他靠近[02:21.89]温柔的他单膝跪地[02:26.11]钻戒缓缓戴进[02:29.23]你的无名指里[02:34.86]当所有人都替你开心[02:38.06]我却才傻傻清醒[02:40.21]原来我们之间已没有任何关系[02:45.78]感谢你特别邀请[02:08.98]来见证你的爱情[02:52.17]我时刻提醒自己 别逃避[02:58.21]今天你妆扮得格外美丽[03:01.73]这美也曾拥在怀里[03:05.49]可惜这是你和他的婚礼[03:09.01]而我只是嘉宾[03:11.38]我放下所有回忆[03:14.58]来成全你的爱情[03:07.79]却始终不愿相信 这是命[03:23.78]说好的永远变成了曾经[03:27.35]我试着衷心祝福你[03:31.00]请原谅我不体面没出息[03:34.60]选择失陪一下 先离席[03:41.81]又不是偶像剧[03:44.98]怎么我演得那么入戏[03:49.87]这不堪入目的剧情[03:56.40]感谢你特别邀请[03:59.38]观赏你要的爱情[04:02.56]嘉宾也许是另一种宿命[04:08.68]离开你的自己事到如今[04:12.54]还有什么资格关心[04:16.14]毕竟终成眷属的人是你[04:19.66]而我只是嘉宾[04:22.17]我流尽所有回忆[04:24.99]来庆祝你的婚礼[04:28.13]却始终没有勇气 祝福你[04:34.18]谢谢你送给我最后清醒[04:37.72]把自己还给我自己[04:44.67]至少我还能够成为那个[04:48.43]见证你们爱情的嘉宾[04:55.03]遇见你的他真的好幸运[04:58.88]但愿他会比我更爱你'
        },
        {
          name: "大家一起喜洋洋",//歌名
          artist: '娆春乔',//歌手
          url: 'https://www.dgq63136.icu/%E5%A8%86%E6%98%A5%E4%B9%94-%E5%A4%A7%E5%AE%B6%E4%B8%80%E8%B5%B7%E5%96%9C%E6%B4%8B%E6%B4%8B.mp3',//音频文件地址
          cover: 'http://imge.kugou.com/stdmusic/20200620/20200620075352596023.jpg',//音乐封面地址
          lrc: '[00:00.84]大白菜 鸡毛菜 通心菜 油麦菜[00:04.38]绿的菜 白的菜[00:06.42]什么菜炒什么菜[00:08.17]喜羊羊 美羊羊 懒羊羊 沸羊羊[00:10.56]什么羊什么样[00:13.26]什么羊都喜洋洋[00:26.90]我们是一群小小的羊[00:29.68]小小的羊儿都很善良[00:33.73]善良得只会在草原上[00:36.60]懒懒的 美美的 晒太阳[00:40.36]虽然邻居住着灰太狼[00:43.22]虽然有时候没有太阳[00:46.92]只有羊村里有音乐[00:49.36]唱唱的 跳跳的 都疯狂[00:53.31]大白菜 鸡毛菜 通心菜 油麦菜[00:57.31]绿的菜 白的菜[00:59.02]什么菜炒什么菜[01:00.20]喜羊羊 美羊羊 懒羊羊 沸羊羊[01:04.11]什么羊什么样什么羊都喜洋洋[01:33.28]狼来的日子很平常[01:36.04]狼嚎的声音像饿得慌[01:40.11]小小的羊儿爱吃草[01:42.52]必要时也不怕跟狼打仗[01:46.53]我们虽然是群小小的羊[01:49.30]每个节日都一起歌唱[01:53.07]阳光空气青草和花香[01:56.07]挤挤的 满满的 在草原上[01:59.72]大白菜 鸡毛菜 通心菜 油麦菜[02:03.49]绿的菜 白的菜[02:04.72]什么菜炒什么菜[02:06.33]喜羊羊 美羊羊 懒羊羊 沸羊羊[02:11.03]什么羊什么样[02:11.97]什么羊都喜洋洋}'
        },
        {
          name: "生日快乐歌(乱七八糟版)", //歌名
          artist: '小团体', //歌手
          url: 'https://www.dgq63136.icu/%E5%A8%86%E6%98%A5%E4%B9%94-%E5%A4%A7%E5%AE%B6%E4%B8%80%E8%B5%B7%E5%96%9C%E6%B4%8B%E6%B4%8B.mp3',//音频文件地址
          cover: 'https://tse4-mm.cn.bing.net/th/id/OIP-C.Xk5nmZbuv1UNIuWfGjcWMAHaC9?w=322&h=140&c=7&r=0&o=5&pid=1.7',//音乐封面地址
          lrc: '[00:00.25]分手后第几个冬季[00:19.65]今天是星期几[00:22.84]偶尔会想起你[00:28.43]你突如其来的简讯[00:32.54]让我措手不及[00:35.75]愣住站在原地(胖：Wow)[00:41.07]当所有人都替你开心[00:44.25]我却才傻傻清醒[00:46.97]原来早已有人为你订做了嫁衣[00:52.36]感谢你特别邀请[00:55.51]来见证你的爱情[00:58.74]我时刻提醒自己 别逃避[01:04.86]拿着喜帖一步一步走近[01:08.32]他精心布置的场地[01:11.87]可惜这是属于你的风景[01:15.38]而我只是嘉宾[01:18.03]我放下所有回忆[01:21.04]来成全你的爱情[01:24.14]却始终不愿相信 这是命[01:30.16]好久不见的你有点疏离[01:33.79]握手寒暄如此客气[01:37.48]何必要在他的面前刻意[01:40.96]隐瞒我的世界 有过你[02:08.74]不知不觉钟声响起[02:13.47]你守候在原地[02:16.48]等待着他靠近[02:21.89]温柔的他单膝跪地[02:26.11]钻戒缓缓戴进[02:29.23]你的无名指里[02:34.86]当所有人都替你开心[02:38.06]我却才傻傻清醒[02:40.21]原来我们之间已没有任何关系[02:45.78]感谢你特别邀请[02:08.98]来见证你的爱情[02:52.17]我时刻提醒自己 别逃避[02:58.21]今天你妆扮得格外美丽[03:01.73]这美也曾拥在怀里[03:05.49]可惜这是你和他的婚礼[03:09.01]而我只是嘉宾[03:11.38]我放下所有回忆[03:14.58]来成全你的爱情[03:07.79]却始终不愿相信 这是命[03:23.78]说好的永远变成了曾经[03:27.35]我试着衷心祝福你[03:31.00]请原谅我不体面没出息[03:34.60]选择失陪一下 先离席[03:41.81]又不是偶像剧[03:44.98]怎么我演得那么入戏[03:49.87]这不堪入目的剧情[03:56.40]感谢你特别邀请[03:59.38]观赏你要的爱情[04:02.56]嘉宾也许是另一种宿命[04:08.68]离开你的自己事到如今[04:12.54]还有什么资格关心[04:16.14]毕竟终成眷属的人是你[04:19.66]而我只是嘉宾[04:22.17]我流尽所有回忆[04:24.99]来庆祝你的婚礼[04:28.13]却始终没有勇气 祝福你[04:34.18]谢谢你送给我最后清醒[04:37.72]把自己还给我自己[04:44.67]至少我还能够成为那个[04:48.43]见证你们爱情的嘉宾[04:55.03]遇见你的他真的好幸运[04:58.88]但愿他会比我更爱你'
        },
        {
          name: "父亲", //歌名
          artist: '冬瓜强', //歌手
          url: 'https://www.dgq63136.icu/%E6%81%8B%E7%88%B1%E5%BE%AA%E7%8E%AF%20-%20%E7%BE%8E%E5%88%80melody.mp3',//音频文件地址
          cover: 'https://ts1.cn.mm.bing.net/th?id=OIP-C.-v8D83XsIIm2UuUunLT3egHaHa&w=177&h=185&c=8&rs=1&qlt=90&o=6&pid=3.1&rm=2',//音乐封面地址
          lrc: '[00:00.00]冬瓜强 - 父亲[00:16.31]总是向你索取 却不曾说谢谢你[00:32.21]直到长大以后 才懂得你不容易[00:39.11]每次离开总是 装做轻松的样子[00:45.32]微笑着说回去吧 转身泪湿眼底[00:52.10]多想和从前一样 牵你温暖手掌[00:58.47]可是你不在我身旁 托清风捎去安康[01:08.71]时光时光慢些吧 不要再让你再变老了[01:15.29]我愿用我一切 换你岁月长留[01:21.07]一生要强的爸爸 我能为你做些什么[01:28.48]微不足道的关心收下吧[01:35.06]谢谢你做的一切 双手撑起我们的家[01:41.41]总是竭尽所有 把最好的给我[01:47.27]我是你的骄傲吗 还在为我而担心吗[01:54.77]你牵挂的孩子啊 长大啦~~~~~[02:10.30]嗯~~[02:27.30]在看呢[02:30.30]客气客气，不用谢[02:34.30]多想和从前一样 牵你温暖手掌[02:40.32]可是你不在我身旁 托清风捎去安康[02:50.56]时光时光慢些吧 不要再让你再变老了[02:57.10]我愿用我一切 换你岁月长留[03:03.14]一生要强的爸爸 我能为你做些什么[03:10.36]微不足道的关心收下吧[03:17.13]谢谢你做的一切 双手撑起我们的家[03:23.44]总是竭尽所有 把最好的给我[03:29.70]我是你的骄傲吗 还在为我而担心吗[03:36.42]你牵挂的孩子啊 长大啦~~~~~[03:43.03]时光时光慢些吧 不要再让你再变老了[03:49.82]我愿用我一切 换你岁月长留[03:56.37]我是你的骄傲吗 还在为我而担心吗[04:02.81]你牵挂的孩子啊 长大啦~~~~~[04:09.40]感谢一路上有你'
        },
        {
          name: "恋爱循环", //歌名
          artist: '美刀melody', //歌手
          url: 'https://www.dgq63136.icu/%E6%81%8B%E7%88%B1%E5%BE%AA%E7%8E%AF%20-%20%E7%BE%8E%E5%88%80melody.mp3',//音频文件地址
          cover: 'http://p1.music.126.net/wImDxYDsJcWDIH9znDhEPA==/109951165561008752.jpg?param=130y130',//音乐封面地址
          lrc: '[00:01:00] でもそんなんじゃだめ[00:03:00] もうそんなんじゃほら[00:05:00] 心は進化するよ[00:07:00] もっともっと[00:39:00] 言葉にすれば[00:40:00] 消えちゃう関係なら[00:41:00] 言葉を消せばいいやって[00:43:00] 思ってた恐れてた[00:44:00] だけどあれ? [00:45:00] なんかちがうかも[00:47:00] せんりのみちもいっぽから[00:48:00] 石のようにかたい[00:50:00] そんな意志で[00:50:00] ちりもつもれば[00:51:00] やまとなでしこ? [00:52:00] 「し」抜きでいや死ぬ気で[00:54:00] ふわふわりふわふわる[00:57:00] あなたが名前を呼ぶ[00:59:00] それだけで[01:00:00] 宙へ浮かぶ[01:02:00] ふわふわるふわふわり[01:05:00] あなたが笑っている[01:07:00] それだけで[01:08:00] 笑顔になる[01:09:00] 神様ありがとう[01:13:00] 運命のいたずらでも[01:17:00] めぐり逢えたことが[01:21:00] しあわせなの[01:40:00] でもそんなんじゃだめ[01:42:00] もうそんなんじゃほら[01:44:00] 心は進化するよ[01:46:00] もっともっと[01:47:00] そうそんなんじゃやだ[01:49:00] ねぇそんなんじゃまだ[01:51:00] 私のこと見ててね[01:53:00] ずっとずっと[01:55:00] 私の中のあなたほど[01:57:00] あなたの中の私の存在は[01:59:00] まだまだ大きくないことも[02:01:00] わかってるけれど[02:03:00] 今この同じ瞬間[02:05:00] 共有してる実感[02:06:00] ちりもつもればやまとなでしこ[02:09:00] 略して?ちりつもやまとなでこ[02:11:00] くらくらりくらくらる[02:13:00] あなたを見上げたら[02:15:00] それだけで[02:16:00] まぶしすぎて[02:18:00] くらくらるくらくらり[02:21:00] あなたを想っている[02:23:00] それだけで[02:24:00] とけてしまう[02:26:00] 神様ありがとう[02:29:00] 運命のいたずらでも[02:33:00] めぐり逢えたことが[02:37:00] しあわせなの[02:41:00] コイスルキセツハヨクバリcirculation[02:49:00] コイスルキモチハヨクバリcirculation[02:56:00] コイスルヒトミハヨクバリcirculation[03:04:00] コイスルオトメハヨクバリcirculation[03:11:00] ふわふわりふわふわる[03:14:00] あなたが名前を呼ぶ[03:16:00] それだけで[03:17:00] 宙へ浮かぶ[03:19:00] ふわふわるふわふわり[03:22:00] あなたが笑っている[03:24:00] それだけで[03:25:00] 笑顔になる[03:27:00] 神様ありがとう[03:30:00] 運命のいたずらでも[03:34:00] めぐり逢えたことが[03:38:00] しあわせなの[03:57:00] でもそんなんじゃだめ[03:59:00] もうそんなんじゃほら[04:01:00] 心は進化するよ[04:03:00] もっともっと[04:04:00] そうそんなんじゃやだ[04:06:00] ねぇそんなんじゃまだ[04:08:00] 私のこと見ててね[04:10:00] ずっとずっと'
        },
        {
          name: "一路向北", //歌名
          artist: '冬瓜强，苏麒芳', //歌手
          url: 'https://www.dgq63136.icu/%E5%86%AC%E7%93%9C%2C%E8%8B%8F%E5%BC%9F-%E4%B8%80%E8%B7%AF%E5%90%91%E5%8C%97.mp3',//音频文件地址
          cover: 'http://imge.kugou.com/stdmusic/20160907/20160907190357712844.jpg',//音乐封面地址
          lrc: '[00:00:01] 音质有点差，见谅！ '
        }
      ]
    }
  },
  methods: {
    addMyAudio() {
      const ap = new APlayer({
        container: document.getElementById('aplayer'),
        audio: this.audio,
        lrcType: 2,
        mutex: true,
        volume: 0.5,
      })
    }
  }
}
</script>

<style>

</style> -->